# Customer Loyalty Analysis

### R, F, and M stand for

• Recency – How recently did the customer purchase?

• Frequency – How often do they purchase?

• Monetary Value – How much do they spend

####Purpose: Customer Loyalty analysis of customer: RFM

Goal 1: Segment the customer based on their purchase activity;

Goal 2: Identify which type of customer should be promoted to make profit;

Goal 3: Calculate the customer life time value

### Step 1

In [ ]:
################################################################################################################################################################
# Step 1: Load data and check the data structure
################################################################################################################################################################

In [5]:
pwd

'E:\\Python\\Resume Projects\\Customer Loyalty RFM CLTV NPS'

In [4]:
import os

os.chdir('E:\\Python\\Resume Projects\\Customer Loyalty RFM CLTV NPS\\')

In [6]:
import pandas as pd
import numpy as np

In [31]:
df_cust = pd.read_csv('Order_Data.csv', index_col=None)

In [24]:
df_cust.head()

   ID      Date  Amount
0   4  20160101   29.33
1   4  20160118   29.73
2   4  20160802   14.96
3   4  20161212   26.48
4  21  20160101   63.34

In [25]:
df_cust.shape

(6919, 3)

In [26]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6919 entries, 0 to 6918
Data columns (total 3 columns):
ID        6919 non-null int64
Date      6919 non-null int64
Amount    6919 non-null float64
dtypes: float64(1), int64(2)
memory usage: 162.2 KB

In [27]:
df_cust.describe()

                 ID          Date       Amount
count   6919.000000  6.919000e+03  6919.000000
mean   11682.515826  2.016217e+07    35.278500
std     6833.386793  3.744182e+03    34.074377
min        4.000000  2.016010e+07     0.000000
25%     5525.000000  2.016022e+07    14.490000
50%    11749.000000  2.016042e+07    25.990000
75%    17717.000000  2.016103e+07    42.970000
max    23569.000000  2.017063e+07   506.970000

In [32]:
df_cust['Date'] = pd.to_datetime(df_cust['Date'], yearfirst=True, format='%Y%m%d', errors='ignore')

In [29]:
df_cust.describe()

                 ID          Date       Amount
count   6919.000000  6.919000e+03  6919.000000
mean   11682.515826  2.016217e+07    35.278500
std     6833.386793  3.744182e+03    34.074377
min        4.000000  2.016010e+07     0.000000
25%     5525.000000  2.016022e+07    14.490000
50%    11749.000000  2.016042e+07    25.990000
75%    17717.000000  2.016103e+07    42.970000
max    23569.000000  2.017063e+07   506.970000

In [33]:
df_cust.head()

   ID       Date  Amount
0   4 2016-01-01   29.33
1   4 2016-01-18   29.73
2   4 2016-08-02   14.96
3   4 2016-12-12   26.48
4  21 2016-01-01   63.34

In [43]:
df_cust['ID'].unique().size

2357

In [45]:
#Conclution: The data has 3 variables, ID(customer ID), Date(the date of the transaction) and Amount (the dolloar value of the transaction). 
#There are 6,919 records total and 2,357 unique customers.

### Step 2

In [44]:
################################################################################################################################################################
#Step 2: R,F,and M analysis.
#R(Recency): How recently did the customer purchase?
#F(Frequency): How often do they purchase?
#M(Monetary value): How much do they spend each time on average?
################################################################################################################################################################

In [47]:
startDate = max(df_cust['Date'])
endDate = min(df_cust['Date'])

In [48]:
startDate

Timestamp('2017-06-30 00:00:00')

In [49]:
endDate

Timestamp('2016-01-01 00:00:00')

In [52]:
df1 = df_cust.sort_values(by=['Date'], ascending = False)

In [54]:
df1.head()

         ID       Date  Amount
971    3487 2017-06-30   11.88
2236   8022 2017-06-30  200.57
1663   5847 2017-06-29   12.58
2098   7513 2017-06-28   11.49
6785  23204 2017-06-28   33.99

In [57]:
df1.shape

(6919, 3)

In [55]:
df2 = df1.drop_duplicates(keep='first')

In [56]:
df2.head()

         ID       Date  Amount
971    3487 2017-06-30   11.88
2236   8022 2017-06-30  200.57
1663   5847 2017-06-29   12.58
2098   7513 2017-06-28   11.49
6785  23204 2017-06-28   33.99

In [58]:
df2.shape

(6898, 3)

In [59]:
from datetime import datetime

In [ ]:
datetime.

In [ ]:
df2['Recency'] =